// Глава 11. Виртуальные функции
#include <iostream>

using namespace std;

// Task 1


///////////////////////////////////////////////////////////



///////////////////////////////////////////////////////////

int main(int argc, char* argv[]) 
{
    /*1. Пусть имеется та же издательская компания, которая описана в упражнении 1 главы 9, которая продает и книги, и аудио версии 
    печатной продукции. Как и в том упражнении, создайте класс publication, хранящий название (фактически, строку) и цену (типа float) 
    публикации. Создайте два порожденных класса: book, в котором происходит изменение счетчика страниц (типа int), и tape, в котором 
    происходит изменение счетчика записанных на кассету минут. Каждый из классов должен иметь метод getdata(), запрашивающий информацию 
    у пользователя, и putdata() для вывода данных на экран. */
    
    return 0;
}