// Глава 12. Потоки и файлы
#include <iostream>

using namespace std;

///////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////

int main(int argc, char* argv[]) {

    // ввод не цифр, а каких-либо символов (например, «девять» вместо «9») 
    while(true) {           // Цикл до тех пор. пока ввод не будет корректным
        cout << "\nВведите целое число: ";
        cin >> i;
        if(cin.good()) {                    // если нет ошибок (goodbit flag)
            cin.ignore(10, '\n');           // удалить разделитель строк
            break;                          // выйти из цикла
        }
        cin.clear();                        // Очистить биты ошибок
        cout << "Неправильный ввод данных";
        cin.ignore(10, '\n');               // Удалить разделитель строк
    }
    cout << "целое число: " << i;           // целое без ошибок

///////////////////////////////////////////////////////////

    return 0;
}